Configuration_project_01/src/Catalogs/АЭС_ПунктыВыдачи/АЭС_ПунктыВыдачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АЭС_ПунктыВыдачи</name>
  <attributes>
    <name>КодРегион</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьЗаданияПользователям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Розничный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Configuration_project_01/src/Catalogs/АЭС_ПунктыВыдачи/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ФормироватьЗаданияПользователям И ЭтотОбъект.Пользователи.Количество() = 0 Тогда
		
		Отказ = Истина;
		Сообщить("Установлен параметр: формировать задания пользователям, заполните пользователей на вкладке ""Пользователи""");
		
	КонецЕсли; // Если ФормироватьЗаданияПользователям И ЭтотОбъект.Пользователи.Количество() = 0 Тогда	
	
	РазничныйЕсть	= ЭтотОбъект.Склады.Найти(Истина,"Розничный");
	
	Если РазничныйЕсть = Неопределено Тогда
		
		Сообщить("Розничный склад не определен, установите признак ""Розничный"" у розничного склада на вкладке ""Склады");
		Отказ = Истина;
			
	КонецЕсли; // Если НЕ РазничныйЕсть Тогда
	
КонецПроцедуры // Процедура ПередЗаписью(Отказ)
